Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CM-LE_DFP/1.0.110/edc/PIC32CM5164LE00064.PIC
      <edc:SFRDef edc:_addr="0x41004024" edc:access="nnnnnnnnnnnn-nnnnnnnnnnnnnnnnnnn" edc:cname="PARAM" edc:impl="0xFFF7FFFF" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="NVMCTRL">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="NVMCTRL">
            <edc:SFRFieldDef edc:cname="FLASHP" edc:desc="FLASH Pages" edc:nzwidth="0x10"/>
            <edc:SFRFieldDef edc:cname="PSZ" edc:desc="Page Size" edc:nzwidth="0x3">
              <edc:SFRFieldSemantic edc:cname="8" edc:desc="8 bytes" edc:when="(field &amp; 0x7) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="16" edc:desc="16 bytes" edc:when="(field &amp; 0x7) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="32" edc:desc="32 bytes" edc:when="(field &amp; 0x7) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="64" edc:desc="64 bytes" edc:when="(field &amp; 0x7) == 0x3"/>
              <edc:SFRFieldSemantic edc:cname="128" edc:desc="128 bytes" edc:when="(field &amp; 0x7) == 0x4"/>
              <edc:SFRFieldSemantic edc:cname="256" edc:desc="256 bytes" edc:when="(field &amp; 0x7) == 0x5"/>
              <edc:SFRFieldSemantic edc:cname="512" edc:desc="512 bytes" edc:when="(field &amp; 0x7) == 0x6"/>
              <edc:SFRFieldSemantic edc:cname="1024" edc:desc="1024 bytes" edc:when="(field &amp; 0x7) == 0x7"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="DFLASHP" edc:desc="DATAFLASH Pages" edc:nzwidth="0xC"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x41004028" edc:offset="0xC"/>
      <edc:SFRDef edc:_addr="0x41004034" edc:access="nnnnnnnn-------------nnn-----n-n" edc:cname="SECCTRL" edc:impl="0xFF000705" edc:mclr="00000000000000000000000000110000" edc:nzwidth="0x20" edc:por="00000000000000000000000000110000" ltx:memberofperipheral="NVMCTRL">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="NVMCTRL">
            <edc:SFRFieldDef edc:cname="TAMPEEN" edc:desc="Tamper Erase Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="SILACC" edc:desc="Silent Access" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x5"/>
            <edc:SFRFieldDef edc:cname="TEROW" edc:desc="Tamper Rease Row" edc:nzwidth="0x3"/>
            <edc:AdjustPoint edc:offset="0xD"/>
            <edc:SFRFieldDef edc:cname="KEY" edc:desc="Write Key" edc:nzwidth="0x8">
              <edc:SFRFieldSemantic edc:cname="KEY" edc:desc="Write Key" edc:when="(field &amp; 0xFF) == 0xA5"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x41004038" edc:access="------------------------------nn" edc:cname="SCFGB" edc:impl="0x3" edc:mclr="00000000000000000000000000000011" edc:nzwidth="0x20" edc:por="00000000000000000000000000000011" ltx:memberofperipheral="NVMCTRL">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="NVMCTRL">
            <edc:SFRFieldDef edc:cname="BCREN" edc:desc="Boot Configuration Row Read Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="BCWEN" edc:desc="Boot Configuration Row Write Enable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4100403C" edc:access="-------------------------------n" edc:cname="SCFGAD" edc:impl="0x1" edc:mclr="00000000000000000000000000000001" edc:nzwidth="0x20" edc:por="00000000000000000000000000000001" ltx:memberofperipheral="NVMCTRL">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="NVMCTRL">
            <edc:SFRFieldDef edc:cname="URWEN" edc:desc="User Row Write Enable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x41004040" edc:offset="0x8C"/>
      <edc:SFRDef edc:_addr="0x410040CC" edc:access="-------------------------------r" edc:cname="MEMTYPE" edc:impl="0x1" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="DSU">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DSU">
            <edc:SFRFieldDef edc:cname="SMEMP" edc:desc="System Memory Present" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x410040D0" edc:access="------------------------rrrrrrrr" edc:cname="PID4" edc:impl="0xFF" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="DSU">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DSU">
            <edc:SFRFieldDef edc:cname="JEPCC" edc:desc="JEP-106 Continuation Code" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="FKBC" edc:desc="4KB count" edc:nzwidth="0x4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x410040D4" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="PID5" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="DSU"/>
      <edc:SFRDef edc:_addr="0x410040D8" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="PID6" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="DSU"/>
      <edc:SFRDef edc:_addr="0x410040DC" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="PID7" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="DSU"/>
      <edc:SFRDef edc:_addr="0x410040E0" edc:access="------------------------rrrrrrrr" edc:cname="PID0" edc:impl="0xFF" edc:mclr="00000000000000000000000011010000" edc:nzwidth="0x20" edc:por="00000000000000000000000011010000" ltx:memberofperipheral="DSU">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DSU">
            <edc:SFRFieldDef edc:cname="PARTNBL" edc:desc="Part Number Low" edc:nzwidth="0x8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x410040E4" edc:access="------------------------rrrrrrrr" edc:cname="PID1" edc:impl="0xFF" edc:mclr="00000000000000000000000011111100" edc:nzwidth="0x20" edc:por="00000000000000000000000011111100" ltx:memberofperipheral="DSU">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DSU">
            <edc:SFRFieldDef edc:cname="PARTNBH" edc:desc="Part Number High" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="JEPIDCL" edc:desc="Low part of the JEP-106 Identity Code" edc:nzwidth="0x4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x410040E8" edc:access="------------------------rrrrrrrr" edc:cname="PID2" edc:impl="0xFF" edc:mclr="00000000000000000000000000001001" edc:nzwidth="0x20" edc:por="00000000000000000000000000001001" ltx:memberofperipheral="DSU">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DSU">
            <edc:SFRFieldDef edc:cname="JEPIDCH" edc:desc="JEP-106 Identity Code High" edc:nzwidth="0x3"/>
            <edc:SFRFieldDef edc:cname="JEPU" edc:desc="JEP-106 Identity Code is used" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="REVISION" edc:desc="Revision Number" edc:nzwidth="0x4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x410040EC" edc:access="------------------------rrrrrrrr" edc:cname="PID3" edc:impl="0xFF" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="DSU">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DSU">
            <edc:SFRFieldDef edc:cname="CUSMOD" edc:desc="ARM CUSMOD" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="REVAND" edc:desc="Revision Number" edc:nzwidth="0x4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x410040F0" edc:access="------------------------rrrrrrrr" edc:cname="CID0" edc:impl="0xFF" edc:mclr="00000000000000000000000000001101" edc:nzwidth="0x20" edc:por="00000000000000000000000000001101" ltx:memberofperipheral="DSU">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DSU">
            <edc:SFRFieldDef edc:cname="PREAMBLEB0" edc:desc="Preamble Byte 0" edc:nzwidth="0x8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x410040F4" edc:access="------------------------rrrrrrrr" edc:cname="CID1" edc:impl="0xFF" edc:mclr="00000000000000000000000000010000" edc:nzwidth="0x20" edc:por="00000000000000000000000000010000" ltx:memberofperipheral="DSU">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DSU">
            <edc:SFRFieldDef edc:cname="PREAMBLE" edc:desc="Preamble" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="CCLASS" edc:desc="Component Class" edc:nzwidth="0x4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x410040F8" edc:access="------------------------rrrrrrrr" edc:cname="CID2" edc:impl="0xFF" edc:mclr="00000000000000000000000000000101" edc:nzwidth="0x20" edc:por="00000000000000000000000000000101" ltx:memberofperipheral="DSU">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DSU">
            <edc:SFRFieldDef edc:cname="PREAMBLEB2" edc:desc="Preamble Byte 2" edc:nzwidth="0x8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x410040FC" edc:access="------------------------rrrrrrrr" edc:cname="CID3" edc:impl="0xFF" edc:mclr="00000000000000000000000010110001" edc:nzwidth="0x20" edc:por="00000000000000000000000010110001" ltx:memberofperipheral="DSU">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DSU">
            <edc:SFRFieldDef edc:cname="PREAMBLEB3" edc:desc="Preamble Byte 3" edc:nzwidth="0x8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
