Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CM-LE_DFP/1.0.110/edc/PIC32CM5164LE00064.PIC
      <edc:AdjustPoint edc:_addr="0xE000EE00" edc:offset="0x8"/>
      <edc:SFRDef edc:_addr="0xE000EE08" edc:access="--------------nn--------------nn" edc:cname="DSCSR" edc:impl="0x30003" edc:nzwidth="0x20" ltx:memberofperipheral="CoreDebug">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CoreDebug">
            <edc:SFRFieldDef edc:cname="SBRSELEN" edc:desc="Secure Banked register select enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SBRSEL" edc:desc="Secure Banked register select" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0xE"/>
            <edc:SFRFieldDef edc:cname="CDS" edc:desc="Current domain Secure" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CDSKEY" edc:desc="CDS field write-enable key" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0xE000EE0C" edc:offset="0x1A4"/>
      <edc:SFRDef edc:_addr="0xE000EFB0" edc:access="wwwwwwwwwwwwwwwwwwwwwwwwwwwwwwww" edc:cname="DLAR" edc:nzwidth="0x20" ltx:memberofperipheral="DIB">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DIB">
            <edc:SFRFieldDef edc:cname="KEY" edc:desc="Lock access control" edc:nzwidth="0x20">
              <edc:SFRFieldSemantic edc:cname="UNLOCK" edc:desc="Unlock key value" edc:when="(field &amp; 0xFFFFFFFF) == 0xC5ACCE55"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0xE000EFB4" edc:access="-----------------------------rrr" edc:cname="DLSR" edc:impl="0x7" edc:nzwidth="0x20" ltx:memberofperipheral="DIB">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DIB">
            <edc:SFRFieldDef edc:cname="SLI" edc:desc="Software Lock implemented" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SLK" edc:desc="Software Lock status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="nTT" edc:desc="Not thirty-two bit" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0xE000EFB8" edc:access="------------------------rrrr----" edc:cname="DAUTHSTATUS" edc:impl="0xF0" edc:nzwidth="0x20" ltx:memberofperipheral="DIB">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DIB">
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="SID" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="NOSEC" edc:desc="Security Extension not implemented" edc:when="(field &amp; 0x3) == 0"/>
              <edc:SFRFieldSemantic edc:cname="NO" edc:desc="Secure invasive debug prohibited" edc:when="(field &amp; 0x3) == 2"/>
              <edc:SFRFieldSemantic edc:cname="YES" edc:desc="Secure invasive debug allowed" edc:when="(field &amp; 0x3) == 3"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="SNID" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="NOSEC" edc:desc="Security Extension not implemented" edc:when="(field &amp; 0x3) == 0"/>
              <edc:SFRFieldSemantic edc:cname="NO" edc:desc="Secure non-invasive debug prohibited" edc:when="(field &amp; 0x3) == 2"/>
              <edc:SFRFieldSemantic edc:cname="YES" edc:desc="Secure non-invasive debug allowed" edc:when="(field &amp; 0x3) == 3"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0xE000EFBC" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="DDEVARCH" edc:mclr="01000111011100000010101000000100" edc:nzwidth="0x20" edc:por="01000111011100000010101000000100" ltx:memberofperipheral="DIB">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DIB">
            <edc:SFRFieldDef edc:cname="ARCHPART" edc:desc="Architecture Part" edc:nzwidth="0xC"/>
            <edc:SFRFieldDef edc:cname="ARCHVER" edc:desc="Architecture Version" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="REVISION" edc:desc="Revision" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="PRESENT" edc:desc="DEVARCH Present" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ARCHITECT" edc:desc="Architect" edc:nzwidth="0xB"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0xE000EFC0" edc:offset="0xC"/>
      <edc:SFRDef edc:_addr="0xE000EFCC" edc:access="------------------------rrrrrrrr" edc:cname="DDEVTYPE" edc:impl="0xFF" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="DIB">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DIB">
            <edc:SFRFieldDef edc:cname="MAJOR" edc:desc="Major type" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="SUB" edc:desc="Sub-type" edc:nzwidth="0x4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0xE000EFD0" edc:access="------------------------rrrrrrrr" edc:cname="DPIDR4" edc:impl="0xFF" edc:nzwidth="0x20" ltx:memberofperipheral="DIB">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DIB">
            <edc:SFRFieldDef edc:cname="DES_2" edc:desc="JEP106 continuation code" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="SIZE" edc:desc="4KB count" edc:nzwidth="0x4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0xE000EFD4" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="DPIDR5" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="DIB"/>
      <edc:SFRDef edc:_addr="0xE000EFD8" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="DPIDR6" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="DIB"/>
      <edc:SFRDef edc:_addr="0xE000EFDC" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="DPIDR7" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="DIB"/>
      <edc:SFRDef edc:_addr="0xE000EFE0" edc:access="------------------------rrrrrrrr" edc:cname="DPIDR0" edc:impl="0xFF" edc:nzwidth="0x20" ltx:memberofperipheral="DIB">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DIB">
            <edc:SFRFieldDef edc:cname="PART_0" edc:desc="Part number bits[7:0]" edc:nzwidth="0x8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
